app/views/users/index.html.erb

SELECT COUNT(*) FROM "conferences" INNER JOIN "conferences_users" ON "conferences"."id" = "conferences_users"."conference_id" WHERE "conferences_users"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "conferences" WHERE "conferences"."user_id" = ?  [["user_id", 1]]
---
              <div class="card-body">
                <p class="card-text">Conferences as attendee: <%= pluralize(user.conferences.count, "conference") %></p>
                <p class="card-text">Conferences as speaker: <%= pluralize(user.as_speaker_conferences.count, "conference") %></p>