app/views/users/search.html.erb

SELECT COUNT(*) FROM "conferences" WHERE "conferences"."user_id" = ?  [["user_id", 5]]
---
              <div class="card-body">
                <p class="card-text"><%= pluralize(result.conferences.count, "conference") %></p>